# majorgreys Brewfile for macOS development setup
# Install with: brew bundle install

# Taps
tap "d12frosted/emacs-plus"

# Shells & Prompt
brew "fish"
brew "tmux"
brew "starship"

# Editors
brew "emacs-plus@30", args: ["with-native-comp", "with-imagemagick", "with-poll"]
brew "neovim"
brew "helix"

# Core Development Tools
brew "git"
brew "gh"
brew "git-delta"
brew "stow"

# Search & Navigation
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"

# Modern CLI Tools
brew "bat"
brew "eza"
brew "htop"
brew "jq"
brew "yq"

# Build Tools
brew "cmake"
brew "tree-sitter"

# Languages & Runtimes
brew "python@3.12"
brew "go"
brew "zig"
brew "node"

# Python Tools
brew "uv"

# Container Runtime
brew "colima"
brew "docker"
brew "docker-compose"

# Environment & Config
brew "direnv"
brew "coreutils"
brew "topgrade"

# Documentation
brew "pandoc"

# Linters & Formatters
brew "graphviz"
brew "shellcheck"
brew "shfmt"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
