fisherman/await
edc/bass
fisherman/docker-completion
fisherman/fishkit
fisherman/get
fisherman/getopts
fisherman/git_util
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
fisherman/menu
fisherman/pwd_info
fisherman/pwd_is_home
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-thefuck
ojiry/tmux_rename_window
virtualenv
jethrokuan/fzf
jethrokuan/z
fisherman/fish-pipenv
metro
simnalamburt/shellder
rafaelrinaldi/pure
smh/base16-shell-fish
barnybug/docker-fish-completion
