jorgebucaran/fish-getopts
edc/bass
brgmnn/fish-docker-compose
adambrenecki/virtualfish
evanlucas/fish-kubectl-completions
rafaelrinaldi/pure
danhper/fish-ssh-agent
jethrokuan/fzf
aluxian/fish-kube-prompt
