fisherman/await
edc/bass
fisherman/fishkit
fisherman/fzf
fisherman/get
fisherman/getopts
fisherman/git_util
fisherman/host_info
fisherman/humanize_duration
fisherman/last_job_id
fisherman/menu
fisherman/pipenv
fisherman/pwd_info
fisherman/pwd_is_home
fisherman/simple
<<<<<<< HEAD
=======
oh-my-fish/plugin-thefuck
>>>>>>> b79a29b1df6cf8999dd75287dec3002e0dda057a
fisherman/z
