jethrokuan/z
jorgebucaran/fish-getopts
danhper/fish-ssh-agent
edc/bass
jethrokuan/fzf
brgmnn/fish-docker-compose
jorgebucaran/nvm.fish
lilyball/nix-env.fish
reitzig/sdkman-for-fish@v2.1.0
jorgebucaran/hydro
