jorgebucaran/fisher
jethrokuan/z
jorgebucaran/fish-getopts
danhper/fish-ssh-agent
edc/bass
jethrokuan/fzf
brgmnn/fish-docker-compose
pure-fish/pure
jorgebucaran/nvm.fish
