jethrokuan/z
jorgebucaran/fish-getopts
danhper/fish-ssh-agent
edc/bass
jethrokuan/fzf
brgmnn/fish-docker-compose
jorgebucaran/nvm.fish
jhillyerd/plugin-git
budimanjojo/tmux.fish
~/dev/worktrees/WT/experimental/users/tahir.butt/wt
